jackeyjiang/STM32_DGUS/STM32_Demo/utilities/serialscreen/serialscreen.c
 /*******************************************************************************
 * 函数名称:SettleAccounts                                                                 
 * 描    述:当按下结算按钮后的程序流程                                                                                                                        
 * 输    入:无                                                                 
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                   
 *******************************************************************************/ 
char Floor= 0; //作为有商品种类的层数
void SettleAccounts(void)
{
	uint8_t tempcnt=0;
	//清除屏幕显示数据
  for(tempcnt=0;tempcnt<4;tempcnt++)
	{
		MealNameDisp(Null,tempcnt);
		MealCntDisp(Null,tempcnt);//显示数量
		MealCostDisplay(Null,tempcnt);//显示单总价 有两个重复		
	}
	tempcnt=0; /*计数清零*/
  PageChange(Acount_interface);//结算界面
	//在这里做标记 current = payformoney
  //显示硬币数
	VariableChage(payment_coin,UserAct.PayForCoins);
  //显示纸币数
	VariableChage(payment_bill,UserAct.PayForBills);
  //刷卡数
	VariableChage(payment_card,UserAct.PayForCards);
  //显示等待时间
	VariableChage(wait_payfor,60);
	OpenTIM7();
	//程序显示部分
	Floor= 0; //每次进一次结账界面就需要从新写入数据
	
	if(UserAct.MealCnt_1st>0)
	{
		DispMeal[Floor].meal_id= 0x01; //0x01为第一个餐品的ID
		DispMeal[Floor].meal_cnt= UserAct.MealCnt_1st; //餐品的数量赋值
		DispMeal[Floor].meal_cost= UserAct.MealCost_1st; //餐品单总价的赋值
		Floor++;
	}
	if(UserAct.MealCnt_2nd>0)
	{
		DispMeal[Floor].meal_id= 0x02; //0x02为第二个餐品的ID
		DispMeal[Floor].meal_cnt= UserAct.MealCnt_2nd; //餐品的数量赋值
		DispMeal[Floor].meal_cost= UserAct.MealCost_2nd; //餐品单总价的赋值
		Floor++;
	}		
  if(UserAct.MealCnt_3rd>0)
	{
		DispMeal[Floor].meal_id= 0x03; //0x03为第三个餐品的ID
		DispMeal[Floor].meal_cnt= UserAct.MealCnt_3rd; //餐品的数量赋值
		DispMeal[Floor].meal_cost= UserAct.MealCost_3rd; //餐品单总价的赋值
		Floor++;		
	}		
	if(UserAct.MealCnt_4th>0)
	{
		DispMeal[Floor].meal_id= 0x04; //0x01为第四个餐品的ID
		DispMeal[Floor].meal_cnt= UserAct.MealCnt_4th; //餐品的数量赋值
		DispMeal[Floor].meal_cost= UserAct.MealCost_4th; //餐品单总价的赋值
		Floor++;	
	}
	//加入显示的部分：从第一栏开始到第四栏
	for(tempcnt=0;tempcnt<Floor;tempcnt++)
	{
		MealNameDisp(DispMeal[tempcnt].meal_id,tempcnt);//显示菜名  
		MealCntDisp(DispMeal[tempcnt].meal_cnt,tempcnt);//显示数量
		MealCostDisplay(DispMeal[tempcnt].meal_cost,tempcnt);//显示单总价 有两个重复
	}
	UserAct.PayShould= (UserAct.MealCost_1st+UserAct.MealCost_2nd+UserAct.MealCost_3rd+UserAct.MealCost_4th);
	VariableChage(mealtotoal_cost,UserAct.PayShould);
}

 /*******************************************************************************
 * 函数名称:SyncMealNameDisp                                                                  
 * 描    述:数据同步时显示餐品名称                                                          
 *           根据ID 显示名称 ，根据floor 改变现实变量的地址                                                                    
 * 输    入:meal_id ,floor                                                               
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 							
void SyncMealNameDisp(uint8_t meal_id,uint8_t floor)							
{
	  char temp[30]={0};  //存放串口数据的临时数组
		memcpy(temp,VariableWrite,sizeof(VariableWrite));
		temp[2]= 15; //0x83 0x41 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00 0x00
		myunion.adress= sync_column1st_name+ floor*(0x0100); 
		temp[4]= myunion.adr[1];
		temp[5]= myunion.adr[0];
		switch(meal_id)
		{
			case 0x00:break;
			case 0x01:mystrcat(temp,meat_name,10);break;	
			case 0x02:mystrcat(temp,chicken_name,8);break;		
			case 0x03:mystrcat(temp,duck_name,8);break;	
			case 0x04:mystrcat(temp,fish_name,8);break;
			default:break;			
		}
		Uart3_Sent(temp,sizeof(temp));	
}
 /*******************************************************************************
 * 函数名称:SyncMealCntDisp                                                                 
 * 描    述:数据同步时显示餐品数量  ，以文本方式显示                                                        
 *           更具floor 改变变量 ，meal_cnt 是要现实的数量                                                                    
 * 输    入:meal_id                                                                
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                    
 *******************************************************************************/ 							
void SyncMealCntDisp(uint8_t meal_cnt,uint8_t floor)							
{
	  char temp[20]={0};  //存放串口数据的临时数组
		char buffer[5]={0};
		int cnt_t=0,i=0;
		cnt_t= sprintf(buffer,"%d",meal_cnt);
		if(meal_cnt==0xff) cnt_t=0;
		memcpy(temp,VariableWrite,sizeof(VariableWrite));
		temp[2]= 4+cnt_t; //0x83 0x00 0x41 0x00 0x00 0x00 0x00 
		myunion.adress= sync_column1st_number+ floor*(0x0100); 
		temp[4]= myunion.adr[1];
		temp[5]= myunion.adr[0];
		for(i=0;i<cnt_t;i++) temp[i+6]=buffer[i]; 
		Uart3_Sent(temp,sizeof(temp));	
}


 /*******************************************************************************
 * 函数名称:GetPassWord                                                                     
 * 描    述:原始密码 可以加入修改密码函数                                                               
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年4月9日                                                                    
 *******************************************************************************/  
void GetPassWord(unsigned char *PassWord)
{
  PassWord[0] = 5;
	PassWord[1] = 1;
	PassWord[2] = 8;
	PassWord[3] = 5;
	PassWord[4] = 1;
	PassWord[5] = 8;
}

void GetAdminPassWord(unsigned char *PassWord)
{
  PassWord[0] = 1;
	PassWord[1] = 2;
	PassWord[2] = 3;
	PassWord[3] = 4;
	PassWord[4] = 5;
	PassWord[5] = 6;
}
 /*******************************************************************************
 * 函数名称:VerifyPassword                                                                   
 * 描    述:数组比较                                                                 
 *                                                                               
 * 输    入:数组指针1，数组指针2，需比较的长度                                                                    
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年4月9日                                                                     
 *******************************************************************************/  
uint8_t VerifyPassword( uint8_t *Src1, uint8_t *Src2, uint8_t Length)
{
  uint8_t i = 0; 
	for(i = 0; i < Length; i++)
	{
	  if(*(Src1+i) != *(Src2+i))
		{
		    return 0;
		}
	}
	return 1;
}
 /*******************************************************************************
 * 函数名称:ChangeVariableValues                                                                   
 * 描    述:改变数据变量的值                                                                                                                          
 * 输    入:变量地址,变量数据,变量长度                                                                  
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                   
 *******************************************************************************/ 
char meat_cnt_t= 0,chicken_cnt_t= 0,duck_cnt_t= 0,fish_cnt_t= 0; /*临时数量*/
uint8_t  PassWordLen=0;	//密码的长度为0
uint8_t  PassWord[6]={0};
uint8_t  InputPassWord[6]={0};
void ChangeVariableValues(int16_t VariableAdress,char *VariableData,char length)
{
	char MealID =0;
	uint16_t coins_time=0;
	uint8_t i= 0,j=0;
	  switch (VariableAdress)
		{
			case meal_choose: /*主角面用户选择*/
			{
        CloseTIM4();
				switch(VariableData[1])
				{
					case 0x01:
						if(DefineMeal[0].MealCount > 0)	   //判断餐品是否大于0
						{
							PlayMusic(VOICE_1);
							UserAct.MealID= VariableData[1]; //当前用户选餐的ID
							UserAct.MealCnt_1st_t= 1;//设置默认分数为 1							
							WaitTimeInit(&WaitTime);
							VariableChage(count_dowm,WaitTime);
							OpenTIM3();
							PageChange(Meal1st_interface);//显示相应界面
              VariableChage(meat_cnt,0x01);
 							MealCostDisp(UserAct.MealID,UserAct.MealCnt_1st_t);//根据用户所选餐品ID号显示合计钱数
						}break;						
					case 0x02:
						if(DefineMeal[1].MealCount > 0)	   //判断餐品是否大于0
						{
							PlayMusic(VOICE_1);
							UserAct.MealID= VariableData[1];
							UserAct.MealCnt_2nd_t= 1;//设置默认分数为 1
							WaitTimeInit(&WaitTime);
							VariableChage(count_dowm,WaitTime);
							OpenTIM3();							
							PageChange(Meal2rd_interface);//显示相应界面	
							VariableChage(chicken_cnt,0x01);
							MealCostDisp(UserAct.MealID,UserAct.MealCnt_2nd_t);//根据用户所选餐品ID号显示合计钱数
						}break;							
					case 0x03:
						if(DefineMeal[2].MealCount > 0)	   //判断餐品是否大于0
						{
							PlayMusic(VOICE_1);
							UserAct.MealID= VariableData[1];
							UserAct.MealCnt_3rd_t= 1;//设置默认分数为 1
							WaitTimeInit(&WaitTime);
							VariableChage(count_dowm,WaitTime);
							OpenTIM3();							
							PageChange(Meal3ns_interface);//显示相应界面	
							VariableChage(duck_cnt,0x01);
							MealCostDisp(UserAct.MealID,UserAct.MealCnt_3rd_t);//根据用户所选餐品ID号显示合计钱数
						}break;						
					case 0x04:
					{
						PlayMusic(VOICE_1);
						if(DefineMeal[3].MealCount > 0)	   //判断餐品是否大于0
						{
							UserAct.MealID= VariableData[1];
							UserAct.MealCnt_4th_t= 1;//设置默认分数为 1
							WaitTimeInit(&WaitTime);							
							OpenTIM3();	
						  VariableChage(count_dowm,WaitTime);
							PageChange(Meal4th_interface);//显示相应界面	
							VariableChage(fish_cnt,0x01);
							MealCostDisp(UserAct.MealID,UserAct.MealCnt_4th_t);//根据用户所选餐品ID号显示合计钱数
						}			
					}break;
					case 0x05:  /*管理用户键*/
					{
						PageChange(Password_interface);
					}break;
					default:break;
				}
			}break;
        				
