jackeyjiang/STM32_DGUS/STM32_Demo/utilities/serialscreen/serialscreen.c
			case meat_cnt: /*胡萝卜炒肉分数*/
			{
				if(VariableData[1]<= DefineMeal[0].MealCount)	//设置餐品选择的上限
				{
					UserAct.MealCnt_1st_t= VariableData[1];
					UserAct.MealCost_1st = GetMealPrice(UserAct.MealID,UserAct.MealCnt_1st_t);//有一些重复计算
					MealCostDisp(UserAct.MealID,UserAct.MealCnt_1st_t);
				}
				else
				{
					UserAct.MealCnt_1st_t= DefineMeal[0].MealCount;
					MealCostDisp(UserAct.MealID,UserAct.MealCnt_1st_t);
					VariableChage(meat_cnt,UserAct.MealCnt_1st_t);	//改变变量地址数据
				}	 						 
			}break;
			case chicken_cnt:/*香菇滑鸡分数*/
			{
				if(VariableData[1]<= DefineMeal[1].MealCount)	//设置餐品选择的上限
				{
					UserAct.MealCnt_2nd_t= VariableData[1];
					UserAct.MealCost_2nd = GetMealPrice(UserAct.MealID,UserAct.MealCnt_2nd_t);//有一些重复计算
					MealCostDisp(UserAct.MealID,UserAct.MealCnt_2nd_t);
				}
				else
				{
					UserAct.MealCnt_2nd_t= DefineMeal[1].MealCount;
					MealCostDisp(UserAct.MealID,UserAct.MealCnt_2nd_t);
					VariableChage(meat_cnt,UserAct.MealCnt_2nd_t);	//改变变量地址数据
				}	 						 
			}break;
			case duck_cnt:/*脆皮烤鸭*/
			{
				if(VariableData[1]<= DefineMeal[2].MealCount)	//设置餐品选择的上限
				{
					UserAct.MealCnt_3rd_t= VariableData[1];
					UserAct.MealCost_3rd = GetMealPrice(UserAct.MealID,UserAct.MealCnt_3rd_t);//有一些重复计算
					MealCostDisp(UserAct.MealID,UserAct.MealCnt_3rd_t);
				}
				else
				{
					UserAct.MealCnt_3rd_t= DefineMeal[2].MealCount;
					MealCostDisp(UserAct.MealID,UserAct.MealCnt_3rd_t);
					VariableChage(meat_cnt,UserAct.MealCnt_3rd_t);	//改变变量地址数据			
				}	 
			}break;	
			case fish_cnt:/*红烧鱼块*/
			{
				if(VariableData[1]<= DefineMeal[3].MealCount)	//设置餐品选择的上限
				{
					UserAct.MealCnt_4th_t= VariableData[1];
					UserAct.MealCost_4th = GetMealPrice(UserAct.MealID,UserAct.MealCnt_4th_t);//有一些重复计算
					MealCostDisp(UserAct.MealID,UserAct.MealCnt_4th_t);
				}
				else
				{
					UserAct.MealCnt_4th_t= DefineMeal[3].MealCount;
					MealCostDisp(UserAct.MealID,UserAct.MealCnt_4th_t);
					VariableChage(meat_cnt,UserAct.MealCnt_4th_t);	//改变变量地址数据
				}
			}break;	
   
      case mealcnt_choose:/*单页选择按钮*/
      {
			  switch(VariableData[1])
				{
					case 0x01:  /*放入购物车*/
					{
								
					}break;
					case 0x02:  /*继续选餐*/
					{
            PutIntoShopCart();
						PageChange(Menu_interface);
						WaitTimeInit(&WaitTime);
					}break;
 					case 0x03:  /*进入购物车*/
					{
            PutIntoShopCart();
						if(UserAct.Meal_totoal>0)
						{
							SettleAccounts();
							CloseTIM3();
							WaitTimeInit(&WaitTime);
							OpenTIM7();
							Current= waitfor_money;//进入读钱界面
							PlayMusic(VOICE_2);
						}
					}break;
					case 0x04:  /*取消*/
					{
						//清空所有的用户数据???
						ClearUserBuffer();
						PageChange(Menu_interface);
						CloseTIM3();
						Current= current_temperature;//取消进入空闲程序
						
					}break;
					default:break;
				}
			}break;
			/*改变四栏中餐品的数量*/
			/*需要餐品的ID和行号:column1st_count, MealID*/
			case column1st_count:MealID= DispMeal[0].meal_id;goto loop1;
			case column2nd_count:MealID= DispMeal[1].meal_id;goto loop1;
			case column3rd_count:MealID= DispMeal[2].meal_id;goto loop1;
			case column4th_count:MealID= DispMeal[3].meal_id;goto loop1;
			{
loop1:	switch(MealID)
				{
					case 0x00:
					{
						VariableChage(VariableAdress,0); //维持原来所选的数量
					}break;
					case 0x01:
					{
					  if(VariableData[1]<=DefineMeal[MealID-1].MealCount)//当用户选择数量小于或等于存货时
				    {
					    UserAct.MealCnt_1st =VariableData[1]; //将改变的值返回到结构体中
					    UserAct.MealCost_1st =UserAct.MealCnt_1st *price_1st; //计算单总价
					    VariableChage(VariableAdress,UserAct.MealCnt_1st); //改变数量
					    VariableChage(VariableAdress+1,UserAct.MealCost_1st); //改变单总价，地址偏移1
				    }
				    else
				    {	
							VariableChage(VariableAdress,UserAct.MealCnt_1st); //维持原来所选的数量
				    }					
					}break;
					case 0x02:
					{
					  if(VariableData[1]<=DefineMeal[MealID-1].MealCount)//还是要判断数量
				    {
					    UserAct.MealCnt_2nd =VariableData[1]; //将改变的值返回到结构体中
					    UserAct.MealCost_2nd =UserAct.MealCnt_2nd *price_2nd; //计算单总价
					    VariableChage(VariableAdress,UserAct.MealCnt_2nd); //改变数量
					    VariableChage(VariableAdress+1,UserAct.MealCost_2nd); //改变单总价
				    }
				   else
				    {
					    VariableChage(VariableAdress,UserAct.MealCnt_2nd); //维持原来所选的数量
				    }									
					}break;
					case 0x03:
					{
					  if(VariableData[1]<=DefineMeal[MealID-1].MealCount)//还是要判断数量
				    {
					    UserAct.MealCnt_3rd =VariableData[1]; //将改变的值返回到结构体中
					    UserAct.MealCost_3rd =UserAct.MealCnt_3rd *price_3rd; //计算单总价
					    VariableChage(VariableAdress,UserAct.MealCnt_3rd); //改变数量
					    VariableChage(VariableAdress+1,UserAct.MealCost_3rd); //改变单总价
				    }
				   else
				    {
					     VariableChage(VariableAdress,UserAct.MealCnt_3rd); //维持原来所选的数量
				    }							
					}break;
					case 0x04:
					{
					  if(VariableData[1]<=DefineMeal[MealID-1].MealCount)//还是要判断数量
				    {
					    UserAct.MealCnt_4th =VariableData[1]; //将改变的值返回到结构体中
					    UserAct.MealCost_4th =UserAct.MealCnt_4th *price_4th; //计算单总价
					    VariableChage(VariableAdress,UserAct.MealCnt_4th); //改变数量
					    VariableChage(VariableAdress+1,UserAct.MealCost_4th); //改变单总价
				    }
				   else
				    {
					     VariableChage(VariableAdress,UserAct.MealCnt_4th); //维持原来所选的数量
				    }							
					}break;
					default:break;						
				}
				UserAct.PayShould= (UserAct.MealCost_1st+UserAct.MealCost_2nd+UserAct.MealCost_3rd+UserAct.MealCost_4th);
	      VariableChage(mealtotoal_cost,UserAct.PayShould);
			}break;
			case payment_method: /*付款方式*/
			{
				AcountCopy();
				PageChange(Acount_interface+2); //当按下付款后，跳转到另一个页面禁止分数加减
				switch(VariableData[1])
				{
					case 0x01:   /*现金支付*/
					{
						CurrentPoint =2;
						PlayMusic(VOICE_3);
						if(!OpenCashSystem()) printf("cash system is erro2");  //关闭现金接受
					}break;
					case 0x02:   /*银行预付卡*/
					{
						CurrentPoint =7;
						PlayMusic(VOICE_4);
						if(!CloseCashSystem()) printf("cash system is erro3");  //关闭现金接受
					}break;
					case 0x03:   /*深圳通支付*/
					{
						CurrentPoint =8;
						PlayMusic(VOICE_4);
						if(!CloseCashSystem()) printf("cash system is erro4");  //关闭现金接受
						
					}break;
					case 0x04:   /*取消*/
					{
						if(!CloseCashSystem()) printf("cash system is erro5");  //关闭现金接受
						CloseTIM3();
						CloseTIM7();
						CurrentPoint = 0 ;
						UserAct.MoneyBack= UserAct.PayAlready; //超时将收到的钱以硬币的形式返还
            ClearUserBuffer();
						UserAct.Cancle= 0x01;
						PageChange(Menu_interface);
						Current= hpper_out;
					}break;
					default:break;		
				}					
			}break;
			case bill_print:
			{
				switch(VariableData[1])
				{
					case 0x01:   /*打印小票*/
					case 0x02:   /*不打印小票*/
					{
						UserAct.PrintTick= VariableData[1];
							 /*判断是否打印小票*/ 			
            PrintTickFun(&UserAct.PrintTick);
            CloseTIM4();						
						PageChange(Mealout_interface);
					}break;  
					default:break;
				}
			}break;
			case password:
			{
				switch(VariableData[1])
				{
					case 0x00:
					case 0x01:
					case 0x02:
					case 0x03:
					case 0x04:
					case 0x05:
					case 0x06:
					case 0x07:
					case 0x08:
					case 0x09:
					case 0x0A:						
					case 0x0B:
					case 0x0C:
					case 0x0D:
					case 0x0E:
					case 0x0F:
					{
	          if(PassWordLen < 6)
		        {
		          InputPassWord[PassWordLen] = (VariableData[1]);
		          PassWordLen++;
			        DisplayPassWord(PassWordLen);//显示一个字符串******
		        }
	        }break;					
					case 0x10:/*退格键*/
					{
	          if(PassWordLen > 0)
		        {
	            InputPassWord[PassWordLen] = 0;
	            PassWordLen--;
		          DisplayPassWord(PassWordLen);
		        }
					}break;
					case 0x11:/*确认件*/ //需要加入超级密码
					{
	          GetPassWord(PassWord);
    	      if(VerifyPassword(PassWord, InputPassWord,6) == 1) //放餐密码正确
		        {
							PassWordLen = 0;		
							DisplayPassWord(0);//清楚密码显示
						  if(erro_flag!=0) 
						  {
							  break;
						  }							
							//如果有错误标记则break;
		           /*进入餐品放置界面*/
		           PageChange(MealSet_interface);					 
							 InitSetting();//清空第一二三列的数据 //对放餐的数据进行初始化
			         PassWordLen = 0;break;
		        }
						GetAdminPassWord(PassWord);
    	      if(VerifyPassword(PassWord, InputPassWord,6) == 1) //管理员账户
		        {
							//进入管理员功能设置，需要加入特定的功能选择
		           /*进入管理员界面*/
							 if(erro_flag!=0) 
							 {
								 PageChange(Logo_interface);
							   DisplayPassWord(0);//清楚密码显示
			           PassWordLen = 0;							 
								 erro_flag=0;
								 break;
							 }
							 else
							 {
								 PageChange(Coinset_interface);
								 VariableChage(coins_in,CoinsTotoalMessageWriteToFlash.CoinTotoal);
								 DisplayPassWord(0);//清楚密码显示
								 PassWordLen = 0;break;
							 }
		        }
		        else
		        {
		          /*密码验证错误，进入密码输入界面*/
		           PageChange(Password_interface);
							 DisplayPassWord(0);							
			         PassWordLen = 0;
		        }						
	        }break;						
					case 0x12:/*返回*/
					{
						if(erro_flag!=0) 
						{
							 break;
						}								
		        PageChange(Menu_interface);
						DisplayPassWord(0);//清楚密码显示
		        PassWordLen = 0;	
					}break;
          default:break;					
        } 					
			}break;
			case admin_set:
			{
				switch(VariableData[1])
				{
					case 0x01:  /*温度设置按钮*/
					{
						PageChange(TemperatureSet_interface);
					}break;
					case 0x02:  /*餐品设置按钮 应该改为一键清空所有数据 */
					{
						//VariableChage(meal_num,0x01);
						//PageChange(MealInput_interface);
							for(i=0;i<90;i++)
	            {
	              FloorMealMessageWriteToFlash.FlashBuffer[i] = 0 ;
	            }
	            WriteMeal();  //写入餐品数据
							StatisticsTotal(); 
							DispLeftMeal();//
					}break;
					case 0x03:	/*取消键*/
					{
						PageChange(Menu_interface);
					}
          default:break;
				}					
			}break;
			case meal_num:
			{			
			  CurFloor.MealID= VariableData[1];	
				VariableChage(floor_num,CurFloor.FloorNum);
				InitSetting();
			}break;
      case floor_num:
			{
			  CurFloor.FloorNum= VariableData[1];
				InitSetting();
			}break;
      case row_1st:
      {
				CurFloor.FCount= VariableData[1];
			}break;	
      case row_2nd:
      {
				CurFloor.SCount= VariableData[1];
			}break;	
      case row_3rd:
      {
				CurFloor.TCount= VariableData[1];
			}break;	
      case mealinput_choose:
			{
				switch(VariableData[1])
				{
					case 0x01:  /*放满*/
					{
						CurFloor.FCount = 3;
		        CurFloor.SCount = 3;
		        CurFloor.TCount = 3; 
		        CurFloor.MealCount = 9;
					  VariableChage(row_1st,CurFloor.FCount);
		        VariableChage(row_2nd,CurFloor.SCount);
		        VariableChage(row_3rd,CurFloor.TCount);	
					}break;
					case 0x02:  /*清空*/
					{
						CurFloor.FCount = 0;
		        CurFloor.SCount = 0;
		        CurFloor.TCount = 0; 
		        CurFloor.MealCount = 0;
					  VariableChage(row_1st,CurFloor.FCount);
		        VariableChage(row_2nd,CurFloor.SCount);
		        VariableChage(row_3rd,CurFloor.TCount);							
					}break;
					case 0x03:  /*确认*/
					{
						/*计算总共的餐品数*/
						CurFloor.MealCount=  CurFloor.FCount + CurFloor.SCount + CurFloor.TCount;
						/*把当前第一列设置的参数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].FCount    = CurFloor.FCount;
						/*把当前第2列设置的参数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].SCount    = CurFloor.SCount;
						/*把当前第3列设置的参数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].TCount    = CurFloor.TCount;
						/*把当前设置餐的ID号保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].MealID    = CurFloor.MealID;
						/*把当前设置的餐的总数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].MealCount = CurFloor.MealCount;
						/*把设置餐的层数保存起来*/
						FloorMealMessageWriteToFlash.FloorMeal[CurFloor.FloorNum - 1].FloorNum  = CurFloor.FloorNum;
						/*九种菜品*/
						for(j = 0; j < 4; j++)	 //4代表餐ID号
						{
							/*各个餐的数目清零*/
							DefineMeal[j].MealCount = 0;
							/*各个餐的列对应的数目清零*/
							for(i = 0; i < FloorMealNum; i++)
							{
								DefineMeal[j].Position[i][0] = 0;
								DefineMeal[j].Position[i][1] = 0;
								DefineMeal[j].Position[i][2] = 0;
							}
							 /*统计各个餐的数目的总和*/
							for(i = 0; i < FloorMealNum; i++)
							{														 /*餐的ID是从1-4*/
								if(FloorMealMessageWriteToFlash.FloorMeal[i].MealID == j + 1)
								{
									DefineMeal[j].MealCount      = DefineMeal[j].MealCount + FloorMealMessageWriteToFlash.FloorMeal[i].MealCount;
									DefineMeal[j].Position[i][0] = FloorMealMessageWriteToFlash.FloorMeal[i].FCount;
									DefineMeal[j].Position[i][1] = FloorMealMessageWriteToFlash.FloorMeal[i].SCount;
									DefineMeal[j].Position[i][2] = FloorMealMessageWriteToFlash.FloorMeal[i].TCount;
									//printf("DefineMeal[%d].Position[%d][0]=%d\r\n",j,i,DefineMeal[j].Position[i][0]);
								}
							}
						}
						StatisticsTotal(); //先统计数目在写入
						WriteMeal(); //写数据到flash
						DispLeftMeal(); //更新餐品数据
						//printf("DefineMeal[%d].MealCount=%d\r\n",i,DefineMeal[i].MealCount);
					}break;
					case 0x04:  /*数据同步*/
					{
						uint32_t mealcompare_data=0;
						uint8_t mealsample_data=0,cnt_t=0,floor=0;
						for(cnt_t=0x00;cnt_t<0x04;cnt_t++)
						{
							/*显示餐品,数量*/									
              SyncMealNameDisp(0,cnt_t);
              SyncMealCntDisp(0xFF,cnt_t); 									 
						}	
						//禁止屏幕点击*/
             ScreenControl(ScreenDisable);
						//数据同步子程序
						 MealDataCompareFun();
						 if(MealCompareData.MealCompareTotoal==0xFFFFFFFF) //正确
						 {
							 PageChange(Data_synchronization);
							 for(cnt_t=0x00;cnt_t<0x04;cnt_t++)
							 {
									 /*显示餐品,数量*/									
                  SyncMealNameDisp(cnt_t+1,floor);
                  SyncMealCntDisp(DefineMeal[cnt_t].MealCount,floor); 
                  floor++;									 
							 }							 
						 }
             else
             {
							 PageChange(Data_synchronization+2);
							 for(cnt_t=0x00;cnt_t<0x04;cnt_t++)
							 {
								 if(MealCompareData.MealComparePart[cnt_t]==0xff)
								 {
									//餐品同步成功不做任何事情 
								 }
								 else
								 {
									 /*显示餐品,数量*/									
                  SyncMealNameDisp(cnt_t+1,floor);
                  SyncMealCntDisp(MealCompareData.MealComparePart[cnt_t],floor); 
                  floor++;									 
								 }
               }						 
						 }
						//超时时退出，错误退出
						ScreenControl(ScreenEnable);
						DispLeftMeal();//改变剩余餐品数量显示
					}break;
					case 0x05:  /*返回*/
					{
						CurFloor.FCount    = 0;
						CurFloor.SCount    = 0;
						CurFloor.TCount    = 0;
						CurFloor.MealID    = 0;
						CurFloor.MealCount = 0;
						CurFloor.FloorNum  = 0;	 
	          PageChange(MealSet_interface);
					}break;
					default:break;	
				}
			}break;
			case temprature_set:
			{
				SetTemper(VariableData[1]);
			//VariableData[1]; 温度变量=VariableData[1];
			}break;
			case coins_key:
      {
				if(VariableData[1]==0x01)
				{
					Coins_cnt=0;
					coins_time= (CoinsTotoalMessageWriteToFlash.CoinTotoal/10);
					VariableChage(coins_back,Coins_cnt);
					VariableChage(coins_back,CoinsTotoalMessageWriteToFlash.CoinTotoal-SendOutN_Coin(CoinsTotoalMessageWriteToFlash.CoinTotoal));	
          delay_ms(1000*(coins_time+1));					
				  VariableChage(coins_in,CoinsTotoalMessageWriteToFlash.CoinTotoal);//显示机内硬币数
					VariableChage(coins_back,Coins_cnt);
				}
				else if(VariableData[1] == 0x02)
				{
					StopRefond();
					PageChange(Menu_interface);
				}
			}break;	
      case 	coins_in:
      {	
				CoinsTotoalMessageWriteToFlash.CoinsCnt[0]= VariableData[1];
				CoinsTotoalMessageWriteToFlash.CoinsCnt[1]= VariableData[0];
				WriteCoins();
				VariableChage(coins_in,CoinsTotoalMessageWriteToFlash.CoinTotoal);//显示机内硬币数
				
			}break;			
			  default:break;		
		}
}
 /*******************************************************************************
 * 函数名称:DealSeriAceptData                                                                   
 * 描    述:处理从迪文屏幕返回的数据                                                        
 *          如何实现三个连续的数据：0xA5 0XA5 0X5A                                                                           
 * 输    入:无                                                                   
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年3月13日                                                                   
 *******************************************************************************/ 	
void DealSeriAceptData(void)
{
	unsigned char i;
	unsigned char temp,temp1,length,checkout;
	char RegisterAdress=0;
	int16_t VariableAdress=0;
	unsigned char Rx3DataBuff[10]={0};/*设置一个数组大小，?以免越界(out of bounds),?可变长度数组*/
	char RegisterData[5]={0};  //寄存器数据数组
	char VariableData[5]={0};  //变量数据数组
	char VariableLength= 0;   //变量数据的长度
	while(UART3_GetCharsInRxBuf()>=9) //获取缓冲区大小，直至缓冲区无数据
	{	
		if(USART3_GetChar(&temp)==1)
		{	
			if(temp==FH0)	//匹配帧头第一个字节
			{ 
loop:	  if(USART3_GetChar(&temp1)==1)  
				{
					if(temp1==FH1)  //匹配帧头第二个字节：
					{
						if(USART3_GetChar(&length)==1)  //获取命令字节长度
						{
							checkout =1;//置位开始读取命令与数据标志	
						}	
					}
					else if(temp1==FH0)	goto loop; //如果持续出现0xA5则继续判断下一个字节是否为0x5A
				}
			}
		}
	  if(checkout==1) //直到获取数据长度，然后读缓存
	  {
	 	  checkout =0;  //复位标志
		  for(i=0;i<length;i++) USART3_GetChar(Rx3DataBuff+i);
		  if(Rx3DataBuff[0]==0x81)  //读寄存器返回命令
		  {
			  RegisterAdress =Rx3DataBuff[1];
			  for(i=0;i<(length-2);i++)
			  RegisterData[i]=Rx3DataBuff[2+i];
			  //加入修改相关数据的功能
		  }
		  else if(Rx3DataBuff[0]==0x83) //读数据存储器返回命令
		  {
			  myunion.adr[1] =Rx3DataBuff[1]; //有可能是小端模式引起的
			  myunion.adr[0] =Rx3DataBuff[2];
			  VariableAdress =myunion.adress;
			  VariableLength =Rx3DataBuff[3];
			  for(i=0;i<(length-4);i++)
			  VariableData[i]=Rx3DataBuff[4+i];
			  //加入修改变量地址数据的功能
			  ChangeVariableValues(VariableAdress,VariableData,VariableLength);
		   }
	   } 
	 }		
}

